
//  Услуги
import servicesOne from '../components/Layers/Services/services_one/img/services_one.png'; // Краска для деревьев садовая «GOLDBASTIK BT 10»


//  Товары для сада
import services__item_1 from '../components/Layers/Services/min/services__item_1.png'; // Краска для деревьев садовая «GOLDBASTIK BT 10»
import services__item_2 from '../components/Layers/Services/min/services__item_2.png'; // Натяжители
import services__item_3 from '../components/Layers/Services/min/services__item_3.png'; // Подвязочный материал
import services__item_4 from '../components/Layers/Services/min/services__item_4.png'; // Проволка оцинкованная
import services__item_5 from '../components/Layers/Services/min/services__item_5.png'; // Проволока стальная, оцинкованная
import services__item_6 from '../components/Layers/Services/min/services__item_6.png'; // Сетка плетеная рабица, оцинкованная
import services__item_7 from '../components/Layers/Services/min/services__item_7.png'; // Скоба для фиксации проволоки
import services__item_8 from '../components/Layers/Services/min/services__item_8.png'; // Феромонные ловушки 2
import services__item_9 from '../components/Layers/Services/min/services__item_9.png'; // Феромонные ловушки 3
import services__item_10 from '../components/Layers/Services/min/services__item_10.png'; // Феромонные ловушки
import services__item_11 from '../components/Layers/Services/min/services__item_11.png'; // Шпалера садовая
import services__item_12 from '../components/Layers/Services/min/services__item_12.png'; // Ранозажевляющее средство





const initToggleBlocks = {
    view: 'SERVICES',

    //  По умолчанию выводим данные "Услуги"
    viewServices: [
        {
            title: 'Услуги',
            img: `${servicesOne}`,
            text: `
            <h4>Доставка саженцев грецкого ореха в любой регион РФ, страны Ближнего и Дальнего зарубежья</h4>
            <p>
                Все виды посадочных работ
            </p>
            <p>
                Техническое сопровождение на всех этапах закладки и выращивания садовых культур собственной сельхоз техникой
            </p>
            Консультационные услуги:
            <ul>
                <li>- Выбор посадочного материала</li>
                <li>- Разработка карт по внесению подкормки</li>
                <li>- Борьба с вредителями</li>
            </ul>
            <p>
                Обрезка сада (формирование кроны)
            </p>
            `
        }
    ],
    servicesPage: [
        {
            title: 'Услуги',
            img: `${servicesOne}`,
            text: `
            <h4>Доставка саженцев грецкого ореха в любой регион РФ, страны Ближнего и Дальнего зарубежья</h4>
            <p>
                Все виды посадочных работ
            </p>
            <p>
                Техническое сопровождение на всех этапах закладки и выращивания садовых культур собственной сельхоз техникой
            </p>
            Консультационные услуги:
            <ul>
                <li>- Выбор посадочного материала</li>
                <li>- Разработка карт по внесению подкормки</li>
                <li>- Борьба с вредителями</li>
            </ul>
            <p>
                Обрезка сада (формирование кроны)
            </p>
            `
        }
    ],
    // Выбранный товар
    servicesProductsId: {},

    // Массив товаров
    servicesProducts: [
        {
            title: "Краска для деревьев садовая «GOLDBASTIK BT 10»",
            type: "raspberry-blackberry",
            img: `${services__item_1}`,
            active: true,
            text: `
            ПРЕИМУЩЕСТВА
            высокая атмосферостойкость, устойчивость к смыванию
            5 и более месяцев;
            обладает подтвержденными лечебными свойствами;
            защищает от вредителей и болезней;
            прошла испытания, одобрена к применению;
            удобно наносится, высокая укрывистость;
            быстро высыхает после нанесения (1 час);
            экологична и безопасна для дерева и человека;
            цвет после высыхания – белый.
            3,4 кг., 6,8 кг
            ТЕХНИЧЕСКИЕ ХАРАКТЕРИСТИКИ
            Форма выпуска готовый препарат.
            Наименование действующего вещества водная дисперсия синтетического полимера с добавлением фунгицида и вспомогательных веществ.
            Консистенция низкая вязкость
            Цвет покрытия белый после высыхания
            Плотность ок. 1,4 г/см3
            Время высыхания 1 час
            Способ нанесения кисть, валик, распыление
            Расход* 4-8 м2/кг или 0,13-0,25 кг/м2
            Условия применения температура воздуха, краски и поверхности от +8°С
            Культура, обрабатываемые объекты плодовые и декоративные деревья и кустарники
            Морозостойкость нет, не допускать замерзания
            Пожароопасность нет
            Условия хранения при температуре от +5 до +35°С
            Гарантийный срок хранения 2 года, в заводской невскрытой упаковке
            * В зависимости от фактуры древесной коры.
            НАЗНАЧЕНИЕ
            Биотехническое средство для лечебно-профилактической окраски и дезинфекции ствола, ветвей плодовых и декоративных деревьев и кустарников в целях защиты и лечения от возбудителей болезней;
            защищает кору от резких перепадов температур;
            препятствует развитию мхов и лишайников;
            защищает от зимующих насекомых-вредителей;
            способствует заживлению ран, используется для замазывания распилов.
            УСЛОВИЯ НАНЕСЕНИЯ, СПОСОБ ПРИМЕНЕНИЯ
            Культура, обрабатываемые объекты: плодовые и декоративные деревья и кустарники.
            Способ, время обработки, ограничения: наносить в ранневесенний и осенний периоды в сухую погоду при температуре воздуха не ниже + 8°С. Краска наносится в 1-2 слоя без промежуточной сушки валиком, кистью или распылением. Не проводить работы при воздействии на поверхность сильного ветра и атмосферных осадков. Перед окраской скребком либо острым ножом удалить с поверхности грязь и непрочно держащиеся части коры. Перед применением краску перемешать. Сразу после окончания работ рабочие инструменты промыть водой.
            ХРАНЕНИЕ И УТИЛИЗАЦИЯ
            Хранение и транспортировка при температуре от +5 до +35°С в заводской невскрытой упаковке. Не подвергать воздействию влаги, тепла, прямых солнечных лучей. Пустую тару и остатки продукта утилизировать как бытовой мусор.
            МЕРЫ ПРЕДОСТОРОЖНОСТИ
            Малоопасное вещество (4-й класс опасности по ГОСТ 12.1.007). Хранить в недоступном от детей месте.
            Использовать индивидуальные средства защиты. Избегать контакта с глазами и кожей. При попадании краски в глаза следует немедленно обильно промыть их чистой водой и обратиться к врачу.
            СТАНДАРТЫ КАЧЕСТВА
            1. Соответствует требованиям ТУ BY 191905626.003-2016 «Краски для деревьев садовые».
            2. Не подлежит обязательной сертификации.
            3. Продукция прошла государственную регистрацию и включена в Государственный реестр средств защиты растений (пестицидов) и удобрений, разрешенных к применению на территории Республики Беларусь.
            `
        },
        {
            title: "Натяжители",
            type: "raspberry-blackberry",
            img: `${services__item_2}`,
            text: `
            Натяжитель изготовлен из стали, после чего подвергается гальванической оцинковке и окрашивается. 
            Рекомендуемое усилие на растяжение проволок до 400 кг.
            Предназначение: при строительстве ограждений садов, а именно для фиксации и натяжения проволоки при монтаже сетки-рабицы, для исключения ее провисания; 
            монтажа колючей проволоки, тросов, а также при создании интенсивных садов шпалерного содержания.
            Предлагается 2 вида натяжителей проволоки – длиной 100 мм и 120 мм.
            `
        },
        {
            title: "Подвязочный материал",
            type: "raspberry-blackberry",
            img: `${services__item_3}`,
            text: `
            Нарезная зажим-закрутка
            Подвязочный материал, проволока стальная 0, 5 мм, в бумажном оплете, 
            длинной 100 и 150 мм. В упаковке -1000 шт.            
            `
        },
        {
            title: "Проволка оцинкованная",
            type: "raspberry-blackberry",
            img: `${services__item_4}`,
            text: `Проволока стальная, оцинкованная диаметром 1,4 - 2,7 мм`
        },
        {
            title: "Проволока стальная, оцинкованная",
            type: "raspberry-blackberry",
            img: `${services__item_5}`,
            text: `Проволока оцинкованная, ф0.8/1.25мм -2.2/3.3 мм с ПВХ покрытием`
        },
        {
            title: "Сетка плетеная рабица, оцинкованная",
            type: "raspberry-blackberry",
            img: `${services__item_6}`,
            text: `
            Сетка плетеная –рабица, оцинкованная 
            Сетка изготавливается из проволоки оцинкованной, диаметром от 1,5мм до 2,5 мм;
            ячейка сетки от 40*40 мм до 65*65 мм;
            высота рулона от 1,2 м до 2 м;
            длина рулона от 10 м до 20 м.
            `
        },
        {
            title: "Скоба для фиксации проволоки",
            type: "raspberry-blackberry",
            img: `${services__item_7}`,
            text: `Скоба для фиксации проволоки к шпалере (бетонной, деревянной, металлической)`
        },
        {
            title: "Феромонные ловушки",
            type: "raspberry-blackberry",
            img: `${services__item_10}`,
            text: `
            Феромоны-это вещества,которые выделяют растения,животные,также насекомые и синтетические аналоги таких веществ - 
            вызывающие поведенческие или физиологические ответы у подобных себе особей того или другого вида.
            Феромоны подразделяют на 2 класса:
            1. Те, которые влияют на коммуникацию одного и того же вида (внутривидовая).
            2. Связь между разными видами.
            Самцовый вакуум – использование данного метода в борьбе с паразитами – является полностью органическим, без приминения ядов. 
            Для массовой стерилизации самцов расход ловушек на 1 га -от 20-50, в зависимости от силы заражения. 
            При данном методе, нужно вокруг сада выставлять защитный пояс, для того чтоб защитить сад извне, особенно со стороны естественных очагов развития вредителей.
            Дезориентация –  метод, при котором диспенсеры с феромоном выделяют запах самки и развешиваются на деревьях. 
            Используемый феромон с запахом в десять раз сильнее чем у обычных насекомых. Феромонное облако перебивает запах живых насекомых, которые есть в саду. 
            Как результат – подавляющее количество насекомых не могут найти самку для спаривания и соответственно не спариваются и самки откладывают не оплодотворенные яйца-которые погибают.
            РЕКОМЕНДАЦИИ:
            - Контроль ловушек (осмотр и подсчет вредителей) раз в день или три, но не позднее чем 5дней.
            - 20-30 ловушек на 1 га.
            Если в течении 3-7 дней в ловушке:
            от 0-5 шт – степень заражения слабая
            от 6-12 шт – степень заражения средняя
            от 13 шт и более – степень заражения сильная
            `
        },
        {
            title: "Феромонные ловушки 2",
            type: "raspberry-blackberry",
            img: `${services__item_8}`,
            text: `
            Феромоны-это вещества,которые выделяют растения,животные,также насекомые и синтетические аналоги таких веществ - 
            вызывающие поведенческие или физиологические ответы у подобных себе особей того или другого вида.
            Феромоны подразделяют на 2 класса:
            1. Те, которые влияют на коммуникацию одного и того же вида (внутривидовая).
            2. Связь между разными видами.
            Самцовый вакуум – использование данного метода в борьбе с паразитами – является полностью органическим, без приминения ядов. 
            Для массовой стерилизации самцов расход ловушек на 1 га -от 20-50, в зависимости от силы заражения. 
            При данном методе, нужно вокруг сада выставлять защитный пояс, для того чтоб защитить сад извне, особенно со стороны естественных очагов развития вредителей.
            Дезориентация –  метод, при котором диспенсеры с феромоном выделяют запах самки и развешиваются на деревьях. 
            Используемый феромон с запахом в десять раз сильнее чем у обычных насекомых. Феромонное облако перебивает запах живых насекомых, которые есть в саду. 
            Как результат – подавляющее количество насекомых не могут найти самку для спаривания и соответственно не спариваются и самки откладывают не оплодотворенные яйца-которые погибают.
            РЕКОМЕНДАЦИИ:
            - Контроль ловушек (осмотр и подсчет вредителей) раз в день или три, но не позднее чем 5дней.
            - 20-30 ловушек на 1 га.
            Если в течении 3-7 дней в ловушке:
            от 0-5 шт – степень заражения слабая
            от 6-12 шт – степень заражения средняя
            от 13 шт и более – степень заражения сильная
            `
        },
        {
            title: "Феромонные ловушки 3",
            type: "raspberry-blackberry",
            img: `${services__item_9}`,
            text: `
            Феромоны-это вещества,которые выделяют растения,животные,также насекомые и синтетические аналоги таких веществ - 
            вызывающие поведенческие или физиологические ответы у подобных себе особей того или другого вида.
            Феромоны подразделяют на 2 класса:
            1. Те, которые влияют на коммуникацию одного и того же вида (внутривидовая).
            2. Связь между разными видами.
            Самцовый вакуум – использование данного метода в борьбе с паразитами – является полностью органическим, без приминения ядов. 
            Для массовой стерилизации самцов расход ловушек на 1 га -от 20-50, в зависимости от силы заражения. 
            При данном методе, нужно вокруг сада выставлять защитный пояс, для того чтоб защитить сад извне, особенно со стороны естественных очагов развития вредителей.
            Дезориентация –  метод, при котором диспенсеры с феромоном выделяют запах самки и развешиваются на деревьях. 
            Используемый феромон с запахом в десять раз сильнее чем у обычных насекомых. Феромонное облако перебивает запах живых насекомых, которые есть в саду. 
            Как результат – подавляющее количество насекомых не могут найти самку для спаривания и соответственно не спариваются и самки откладывают не оплодотворенные яйца-которые погибают.
            РЕКОМЕНДАЦИИ:
            - Контроль ловушек (осмотр и подсчет вредителей) раз в день или три, но не позднее чем 5дней.
            - 20-30 ловушек на 1 га.
            Если в течении 3-7 дней в ловушке:
            от 0-5 шт – степень заражения слабая
            от 6-12 шт – степень заражения средняя
            от 13 шт и более – степень заражения сильная
            `
        },
        {
            title: "Шпалера садовая",
            type: "raspberry-blackberry",
            img: `${services__item_11}`,
            text: `
            Столбики железобетонные для виноградарства, садоводства и ограждений (шпалера садовая)
            Столб бетонный 70 (В1)*75(В2) см; 80 (В1)*90 (В2) см; 90 (В1)*95(В2) H=90 мм, длиной от 2000 мм до 4500 мм, марка бетона М400; 500; М600, 
            изготовленный по технологии гидротермальной обработки (пропаренный), класс бетона по прочности на сжатие В40, морозостойкостью F200,
             с армированием напрягаемой проволокой Bp-1 диаметром  5мм
            `
        },
        {
            title: "Ранозажевляющее средство",
            type: "raspberry-blackberry",
            img: `${services__item_12}`,
            text: `
            Ранозаживляющее средство для санитарной обработки деревьев
            (100% экологически чистый материал, является аналогом импортного антисептика “Гудрон де пин” (Gudron de pin).
            Скачать банку, и написать на ней ранозажевляющие средства
            Состав: смола хвойных пород деревьев.
            Фасовка от 3 кг до 200 кг.
            Препарат обеспечивает комплексную защиту от проникновения микроорганизмов, 
            обладает консервирующими и антисептическими свойствами. 
            Используется для обработки после прививки саженцев, для заживления глубоких ран.
            Продолжительность эффективности до 6 недель.
            Вторичное назначение:
            - репеллентное средство от грызунов и насекомых в саду. Оказывает отталкивающий эффект от зайцев, мышей, змеи, ящериц;
            - идеально подходит для пропитки лодок, пирсов, домов, столбов, канатов и других материалов, нуждающихся в защите от грибка, плесени
            `
        },
    ]
}

const services = (state = initToggleBlocks, action) => {

    switch (action.type) {
        case 'GET_SERVICES':

            return {
                ...state,
                viewServices: state.servicesPage,
                view: 'SERVICES',
                servicesProductsId: {}
            }

        case 'GET_SERVICES_PROD':

            //  Очищаем item от active class
            state.servicesProducts.map((item, i) => {

                item.active = false;

                if (i === 0) {
                    item.active = true;
                }
            });

            return {
                ...state,
                viewServices: state.servicesProducts,
                view: 'SERVICES_PROD',
                servicesProductsId: state.servicesProducts[0]
            }

        case 'GET_SERVICES_PROD_ID':

            //  Очищаем item от active class
            state.servicesProducts.map((item, i) => {

                item.active = false;
            });


            const itemServicesId = state.servicesProducts.find((item, i) => {

                if (item.title === action.param) {
                    return item.active = true;
                }
            });

            return {
                ...state,
                servicesProductsId: itemServicesId
            }

        default:
            return {
                ...state
            }
    }
}

export default services;