
//  Услуги
// import servicesOne from '../components/Layers/Services/services_one/img/services_one.png';
import servicesOne_1 from '../components/Layers/Services/services_one/min/services_one_1.png'; // Доставка 
import servicesOne_2 from '../components/Layers/Services/services_one/min/services_one_2.png'; // Все виды посадочных работ
import servicesOne_3 from '../components/Layers/Services/services_one/min/services_one_3.png'; // Консультационные услуги 2
import servicesOne_4 from '../components/Layers/Services/services_one/min/services_one_4.png'; // Техническое сопровождение
import servicesOne_5 from '../components/Layers/Services/services_one/min/services_one_5.png'; // Формирование кроны







//  Товары для сада
import services__item_1 from '../components/Layers/Services/min/services__item_1.png'; // Краска для деревьев садовая «GOLDBASTIK BT 10»
import services__item_2 from '../components/Layers/Services/min/services__item_2.png'; // Натяжители
import services__item_3 from '../components/Layers/Services/min/services__item_3.png'; // Подвязочный материал
import services__item_4 from '../components/Layers/Services/min/services__item_4.png'; // Проволка оцинкованная
import services__item_5 from '../components/Layers/Services/min/services__item_5.png'; // Проволока стальная, оцинкованная
import services__item_6 from '../components/Layers/Services/min/services__item_6.png'; // Сетка плетеная рабица, оцинкованная
import services__item_7 from '../components/Layers/Services/min/services__item_7.png'; // Скоба для фиксации проволоки
import services__item_8 from '../components/Layers/Services/min/services__item_8.png'; // Феромонные ловушки 2
import services__item_9 from '../components/Layers/Services/min/services__item_9.png'; // Феромонные ловушки 3
import services__item_10 from '../components/Layers/Services/min/services__item_10.png'; // Феромонные ловушки
import services__item_11 from '../components/Layers/Services/min/services__item_11.png'; // Шпалера садовая
import services__item_12 from '../components/Layers/Services/min/services__item_12.png'; // Ранозажевляющее средство





const initToggleBlocks = {
    view: 'SERVICES',

    //  По умолчанию выводим данные "Услуги"
    viewServices: [
        {
            title: 'Услуги',
            img: `${servicesOne_1}`,
            servicesItems: [
                {
                    title: `
                    Доставка саженцев грецкого ореха в любой регион РФ, страны Ближнего и Дальнего зарубежья
                    `,
                    img: `${servicesOne_1}`,
                    active: true,
                },
                {
                    title: `
                    Все виды посадочных работ
                    `,
                    img: `${servicesOne_2}`,
                },
                {
                    title: `
                    Техническое сопровождение на всех этапах закладки и выращивания садовых культур собственной сельхоз техникой
                    `,
                    img: `${servicesOne_3}`,
                },
                {
                    title: `
                    <span class="mb-10">Консультационные услуги:</span> </br>
                    <span>- Выбор посадочного материала</span> </br>
                    <span>- Разработка карт по внесению подкормки</span></br>
                    <span>- Борьба с вредителями</span></br>
                    `,
                    img: `${servicesOne_4}`,
                },
                {
                    title: `
                    Обрезка сада (формирование кроны)
                    `,
                    img: `${servicesOne_5}`,
                },
            ]
        }
    ],
    servicesPage: [
        {
            title: 'Услуги',
            img: `${servicesOne_1}`,
            servicesItems: [
                {
                    title: `
                    Доставка саженцев грецкого ореха в любой регион РФ, страны Ближнего и Дальнего зарубежья
                    `,
                    img: `${servicesOne_1}`,
                    active: true,
                },
                {
                    title: `
                    Все виды посадочных работ
                    `,
                    img: `${servicesOne_2}`,
                },
                {
                    title: `
                    Техническое сопровождение на всех этапах закладки и выращивания садовых культур собственной сельхоз техникой
                    `,
                    img: `${servicesOne_3}`,
                },
                {
                    title: `
                    <span class="mb-10">Консультационные услуги:</span> </br>
                    <span>- Выбор посадочного материала</span> </br>
                    <span>- Разработка карт по внесению подкормки</span></br>
                    <span>- Борьба с вредителями</span></br>
                    `,
                    img: `${servicesOne_4}`,
                },
                {
                    title: `
                    Обрезка сада (формирование кроны)
                    `,
                    img: `${servicesOne_5}`,
                },
            ]
        }
    ],
    // Выбранная услуга
    servicesItemId: {
        title: `
        Доставка саженцев грецкого ореха в любой регион РФ, страны Ближнего и Дальнего зарубежья
        `,
        img: `${servicesOne_1}`
    },







    // Выбранный товар
    servicesProductsId: {
        title: "Краска для деревьев садовая «GOLDBASTIK BT 10»",
        type: "raspberry-blackberry",
        img: `${services__item_1}`,
        active: true,
        text: `
        НАЗНАЧЕНИЕ
        Биотехническое средство для лечебно-профилактической окраски и дезинфекции ствола, ветвей плодовых и декоративных деревьев и кустарников в целях защиты и лечения от возбудителей болезней;
        - защищает кору от резких перепадов температур;
        - препятствует развитию мхов и лишайников;
        - защищает от зимующих насекомых-вредителей;
        - способствует заживлению ран, используется для замазывания распилов.
        ТЕХНИЧЕСКИЕ ХАРАКТЕРИСТИКИ
        - фасовка в пластиковые емкости 3,4 кг; 6,8 кг; 1000 кг;
        - форма выпуска: готовый препарат;
        - наименование действующего вещества: водная дисперсия синтетического полимера с добавлением фунгицида и вспомогательных веществ;
        - консистенция: низкая вязкость, плотность 1,4 г/см3;
        - цвет покрытия: белый (после полного высыхания до 1 часа);
        - способ нанесения: кисть, валик, распыление;
        - расход: до 8 м2/кг (0,25 кг/м2);
        - условия применения: температура воздуха, краски и поверхности от +8°С;
        - условия хранения при температуре от +5 до +35°С
        - гарантийный срок хранения 2 года, в заводской невскрытой упаковке.
        ПРЕИМУЩЕСТВА
        - высокая атмосферостойкость, 
        - устойчивость к смыванию 5 и более месяцев;
        - обладает подтвержденными лечебными свойствами;
        - защищает от вредителей и болезней;
        - прошла испытания, одобрена к применению;
        - удобно наносится;
        - быстро высыхает после нанесения (1 час);
        - экологична и безопасна для дерева и человека. 
        `
    },
    
    // Массив товаров
    servicesProducts: [
        {
            title: "Краска для деревьев садовая «GOLDBASTIK BT 10»",
            type: "raspberry-blackberry",
            img: `${services__item_1}`,
            active: true,
            text: `
            НАЗНАЧЕНИЕ
            Биотехническое средство для лечебно-профилактической окраски и дезинфекции ствола, ветвей плодовых и декоративных деревьев и кустарников в целях защиты и лечения от возбудителей болезней;
            - защищает кору от резких перепадов температур;
            - препятствует развитию мхов и лишайников;
            - защищает от зимующих насекомых-вредителей;
            - способствует заживлению ран, используется для замазывания распилов.
            ТЕХНИЧЕСКИЕ ХАРАКТЕРИСТИКИ
            - фасовка в пластиковые емкости 3,4 кг; 6,8 кг; 1000 кг;
            - форма выпуска: готовый препарат;
            - наименование действующего вещества: водная дисперсия синтетического полимера с добавлением фунгицида и вспомогательных веществ;
            - консистенция: низкая вязкость, плотность 1,4 г/см3;
            - цвет покрытия: белый (после полного высыхания до 1 часа);
            - способ нанесения: кисть, валик, распыление;
            - расход: до 8 м2/кг (0,25 кг/м2);
            - условия применения: температура воздуха, краски и поверхности от +8°С;
            - условия хранения при температуре от +5 до +35°С
            - гарантийный срок хранения 2 года, в заводской невскрытой упаковке.
            ПРЕИМУЩЕСТВА
            - высокая атмосферостойкость, 
            - устойчивость к смыванию 5 и более месяцев;
            - обладает подтвержденными лечебными свойствами;
            - защищает от вредителей и болезней;
            - прошла испытания, одобрена к применению;
            - удобно наносится;
            - быстро высыхает после нанесения (1 час);
            - экологична и безопасна для дерева и человека. 
            `
        },
        {
            title: "Натяжители",
            type: "raspberry-blackberry",
            img: `${services__item_2}`,
            text: `
            Натяжитель изготовлен из стали, после чего подвергается гальванической оцинковке и окрашивается. Рекомендуемое усилие на растяжение проволок до 400 кг.
            Предназначение: применяется при строительстве ограждений садов, а именно для фиксации и натяжения проволоки при монтаже сетки-рабицы, для исключения ее провисания; монтажа колючей проволоки, тросов, а также при создании интенсивных садов шпалерного содержания.
            Предлагаем 2 вида натяжителей проволоки – длиной 100 мм и 120 мм.            
            `
        },
        {
            title: "Подвязочный материал",
            type: "raspberry-blackberry",
            img: `${services__item_3}`,
            text: `Подвязочный материал, проволока стальная 0, 5 мм, в бумажном оплете, длинной 100 и 150 мм. В упаковке - 1000 шт.`
        },
        {
            title: "Проволка оцинкованная",
            type: "raspberry-blackberry",
            img: `${services__item_4}`,
            text: `Проволока стальная, оцинкованная диаметром 1,4 - 2,7 мм.`
        },
        {
            title: "Проволока стальная, оцинкованная",
            type: "raspberry-blackberry",
            img: `${services__item_5}`,
            text: `Проволока стальная, оцинкованная, диаметром 0,8/1,25мм -2,2/3,3 мм с ПВХ покрытием.`
        },
        {
            title: "Сетка плетеная рабица, оцинкованная",
            type: "raspberry-blackberry",
            img: `${services__item_6}`,
            text: `
            Сетка изготавливается из проволоки оцинкованной, диаметром от 1,5 мм до 2,5 мм;
            ячейка сетки от 40*40 мм до 65*65 мм;
            высота рулона от 1,2 м до 2 м;
            длина рулона от 10 м до 15 м.            
            `
        },
        {
            title: "Скоба для фиксации проволоки",
            type: "raspberry-blackberry",
            img: `${services__item_7}`,
            text: `Скоба предназначена для фиксации проволоки к шпалере (бетонной, деревянной, металлической)`
        },
        {
            title: "Феромонные ловушки",
            type: "raspberry-blackberry",
            img: `${services__item_10}`,
            text: `
            Применение феромонных ловушек.
            Феромонные ловушки – это эффективное современное средство отлова и уничтожения садовых вредителей, таких как плодожерки, стеклянницы, совки, жуки, листовертки. Феромонные ловушки позволяют так же определять начало сезона размножения вредителей. Для создания подобных ловушек используется феромон – синтетический аналог химического вещества, выделяемого вредителями определенного вида и помогающего им отличать особей своего вида и пола от других. Механизм действия феромонной ловушки основан на заманивании насекомых и мотыльков при помощи определенных запахов – феромонов, в специальные ловушки. Что способствует гибели вредителей данного вида и препятствует их дальнейшему размножению и распространению.
            Преимущества феромонных ловушек:
            1.	Феромонные ловушки просты и удобны в применении.
            2.	Феромонные ловушки не ядовиты и абсолютно безопасны для человека.
            3.	Феромоны не накапливаются в воздухе и почве и не загрязняют их.
            4.	В ловушку не попадают полезные и безвредные насекомые.
            
            Феромонные ловушки успешно предотвратят размножение и уничтожат таких насекомых-вредителей, как:
            1.	Азиатская хлопковая совка 
            2.	Азиатская ягодная дрозофила
            3.	Азиатский усач
            4.	Амбарный долгоносик
            5.	Американская белая бабочка
            6.	Американский коконопряд
            7.	Большая комнатная муха
            8.	Большой мучной хрущак
            9.	Восклицательная совка
            10.	Восточная плодожорка
            11.	Гравер обыкновенный
            12.	Гроздевая листовертка
            13.	Древесница въедливая
            14.	Дынная муха
            15.	Египетская хлопковая совка
            16.	Западный кукурузный жук
            17.	Западный цветочный (калифорнийский) трипс
            18.	Зелёная садовая совка
            19.	Зерновая моль
            20.	Зерновая (какаовая) огневка
            21.	Золотистая двухпятнистая совка
            22.	Калифорнийская щитовка
            23.	Капровый жук
            24.	Капустная совка
            25.	Картофельная моль
            26.	Каштановая моль
            27.	Коричнево-мраморный клоп
            28.	Клещ паутинный
            29.	Короед-типограф
            30.	Кукурузная лиственная совка
            31.	Кукурузный долгоносик
            32.	Лесной кольчатый шелкопряд
            33.	Малая наземная совка
            34.	Мельничная огневка
            35.	Непарный шелкопряд
            36.	Новозеландская листовертка
            37.	Озимая совка
            38.	Персиковая плодожорка
            39.	Платяная моль
            40.	Померанцевая щитовка
            41.	Рисовый долгоносик
            42.	Самшитовая огневка
            43.	Сибирский шелкопряд
            44.	Сливовая плодожорка
            45.	Смородиновая стеклянница
            46.	Совка-ипсилон
            47.	Сосновая совка
            48.	Сосновый шелкопряд
            49.	Средиземноморская плодовая муха
            50.	Томатная моль
            51.	Трогодерма черная
            52.	Трогодерма изменчивая
            53.	Тутовая щитовка
            54.	Фундучный (лещиновый) усач
            55.	Фруктовая полосатая моль
            56.	Хлебный точильщик
            57.	Хлопковая моль
            58.	Хлопковая совка
            59.	Хрущаки рода
            60.	Червец Комстока
            61.	Четырехпятнистая зерновка
            62.	Шелкопряд-монашенка
            63.	Шестизубый короед
            64.	Щелкун полосатый посевной
            65.	Южная амбарная огневка
            66.	Яблонная муха
            67.	Яблонная плодожорка
            
            `
        },
        {
            title: "Феромонные ловушки 2",
            type: "raspberry-blackberry",
            img: `${services__item_8}`,
            text: `
            Применение феромонных ловушек.
            Феромонные ловушки – это эффективное современное средство отлова и уничтожения садовых вредителей, таких как плодожерки, стеклянницы, совки, жуки, листовертки. Феромонные ловушки позволяют так же определять начало сезона размножения вредителей. Для создания подобных ловушек используется феромон – синтетический аналог химического вещества, выделяемого вредителями определенного вида и помогающего им отличать особей своего вида и пола от других. Механизм действия феромонной ловушки основан на заманивании насекомых и мотыльков при помощи определенных запахов – феромонов, в специальные ловушки. Что способствует гибели вредителей данного вида и препятствует их дальнейшему размножению и распространению.
            Преимущества феромонных ловушек:
            1.	Феромонные ловушки просты и удобны в применении.
            2.	Феромонные ловушки не ядовиты и абсолютно безопасны для человека.
            3.	Феромоны не накапливаются в воздухе и почве и не загрязняют их.
            4.	В ловушку не попадают полезные и безвредные насекомые.
            
            Феромонные ловушки успешно предотвратят размножение и уничтожат таких насекомых-вредителей, как:
            1.	Азиатская хлопковая совка 
            2.	Азиатская ягодная дрозофила
            3.	Азиатский усач
            4.	Амбарный долгоносик
            5.	Американская белая бабочка
            6.	Американский коконопряд
            7.	Большая комнатная муха
            8.	Большой мучной хрущак
            9.	Восклицательная совка
            10.	Восточная плодожорка
            11.	Гравер обыкновенный
            12.	Гроздевая листовертка
            13.	Древесница въедливая
            14.	Дынная муха
            15.	Египетская хлопковая совка
            16.	Западный кукурузный жук
            17.	Западный цветочный (калифорнийский) трипс
            18.	Зелёная садовая совка
            19.	Зерновая моль
            20.	Зерновая (какаовая) огневка
            21.	Золотистая двухпятнистая совка
            22.	Калифорнийская щитовка
            23.	Капровый жук
            24.	Капустная совка
            25.	Картофельная моль
            26.	Каштановая моль
            27.	Коричнево-мраморный клоп
            28.	Клещ паутинный
            29.	Короед-типограф
            30.	Кукурузная лиственная совка
            31.	Кукурузный долгоносик
            32.	Лесной кольчатый шелкопряд
            33.	Малая наземная совка
            34.	Мельничная огневка
            35.	Непарный шелкопряд
            36.	Новозеландская листовертка
            37.	Озимая совка
            38.	Персиковая плодожорка
            39.	Платяная моль
            40.	Померанцевая щитовка
            41.	Рисовый долгоносик
            42.	Самшитовая огневка
            43.	Сибирский шелкопряд
            44.	Сливовая плодожорка
            45.	Смородиновая стеклянница
            46.	Совка-ипсилон
            47.	Сосновая совка
            48.	Сосновый шелкопряд
            49.	Средиземноморская плодовая муха
            50.	Томатная моль
            51.	Трогодерма черная
            52.	Трогодерма изменчивая
            53.	Тутовая щитовка
            54.	Фундучный (лещиновый) усач
            55.	Фруктовая полосатая моль
            56.	Хлебный точильщик
            57.	Хлопковая моль
            58.	Хлопковая совка
            59.	Хрущаки рода
            60.	Червец Комстока
            61.	Четырехпятнистая зерновка
            62.	Шелкопряд-монашенка
            63.	Шестизубый короед
            64.	Щелкун полосатый посевной
            65.	Южная амбарная огневка
            66.	Яблонная муха
            67.	Яблонная плодожорка
            
            `
        },
        {
            title: "Феромонные ловушки 3",
            type: "raspberry-blackberry",
            img: `${services__item_9}`,
            text: `
            Применение феромонных ловушек.
            Феромонные ловушки – это эффективное современное средство отлова и уничтожения садовых вредителей, таких как плодожерки, стеклянницы, совки, жуки, листовертки. Феромонные ловушки позволяют так же определять начало сезона размножения вредителей. Для создания подобных ловушек используется феромон – синтетический аналог химического вещества, выделяемого вредителями определенного вида и помогающего им отличать особей своего вида и пола от других. Механизм действия феромонной ловушки основан на заманивании насекомых и мотыльков при помощи определенных запахов – феромонов, в специальные ловушки. Что способствует гибели вредителей данного вида и препятствует их дальнейшему размножению и распространению.
            Преимущества феромонных ловушек:
            1.	Феромонные ловушки просты и удобны в применении.
            2.	Феромонные ловушки не ядовиты и абсолютно безопасны для человека.
            3.	Феромоны не накапливаются в воздухе и почве и не загрязняют их.
            4.	В ловушку не попадают полезные и безвредные насекомые.
            
            Феромонные ловушки успешно предотвратят размножение и уничтожат таких насекомых-вредителей, как:
            1.	Азиатская хлопковая совка 
            2.	Азиатская ягодная дрозофила
            3.	Азиатский усач
            4.	Амбарный долгоносик
            5.	Американская белая бабочка
            6.	Американский коконопряд
            7.	Большая комнатная муха
            8.	Большой мучной хрущак
            9.	Восклицательная совка
            10.	Восточная плодожорка
            11.	Гравер обыкновенный
            12.	Гроздевая листовертка
            13.	Древесница въедливая
            14.	Дынная муха
            15.	Египетская хлопковая совка
            16.	Западный кукурузный жук
            17.	Западный цветочный (калифорнийский) трипс
            18.	Зелёная садовая совка
            19.	Зерновая моль
            20.	Зерновая (какаовая) огневка
            21.	Золотистая двухпятнистая совка
            22.	Калифорнийская щитовка
            23.	Капровый жук
            24.	Капустная совка
            25.	Картофельная моль
            26.	Каштановая моль
            27.	Коричнево-мраморный клоп
            28.	Клещ паутинный
            29.	Короед-типограф
            30.	Кукурузная лиственная совка
            31.	Кукурузный долгоносик
            32.	Лесной кольчатый шелкопряд
            33.	Малая наземная совка
            34.	Мельничная огневка
            35.	Непарный шелкопряд
            36.	Новозеландская листовертка
            37.	Озимая совка
            38.	Персиковая плодожорка
            39.	Платяная моль
            40.	Померанцевая щитовка
            41.	Рисовый долгоносик
            42.	Самшитовая огневка
            43.	Сибирский шелкопряд
            44.	Сливовая плодожорка
            45.	Смородиновая стеклянница
            46.	Совка-ипсилон
            47.	Сосновая совка
            48.	Сосновый шелкопряд
            49.	Средиземноморская плодовая муха
            50.	Томатная моль
            51.	Трогодерма черная
            52.	Трогодерма изменчивая
            53.	Тутовая щитовка
            54.	Фундучный (лещиновый) усач
            55.	Фруктовая полосатая моль
            56.	Хлебный точильщик
            57.	Хлопковая моль
            58.	Хлопковая совка
            59.	Хрущаки рода
            60.	Червец Комстока
            61.	Четырехпятнистая зерновка
            62.	Шелкопряд-монашенка
            63.	Шестизубый короед
            64.	Щелкун полосатый посевной
            65.	Южная амбарная огневка
            66.	Яблонная муха
            67.	Яблонная плодожорка
            
            `
        },
        {
            title: "Шпалера садовая",
            type: "raspberry-blackberry",
            img: `${services__item_11}`,
            text: `
            Столб железобетонный изготавливается в 3х типоразмерах: 
            70 (В1)*75(В2) см; 80 (В1)*90 (В2) см; 90 (В1)*95(В2) при H=90 мм.
            Длина может варьироваться: от 2000 мм до 4500 мм.
            Используемая марка бетона: М400; 500; М600.
            Класс бетона по прочности на сжатие - В40.
            Морозостойкостью F200.
            Технология изготовления: гидротермальная обработка (пропаривание), с армированием напрягаемой проволокой Bp-1 диаметром 5 мм.            
            `
        },
        {
            title: "Ранозажевляющее средство",
            type: "raspberry-blackberry",
            img: `${services__item_12}`,
            text: `
            100% экологически чистый материал (является аналогом импортного антисептика “Гудрон де пин”/Gudron de pin).
            Состав: смола хвойных пород деревьев.
            Фасовка от 3 кг до 200 кг.
            Препарат обеспечивает комплексную защиту от проникновения микроорганизмов, обладает консервирующими и антисептическими свойствами. Используется для обработки после прививки саженцев, для заживления глубоких ран.
            Продолжительность эффективности до 6 недель.
            Вторичное назначение:
            - репеллентное средство от грызунов и насекомых в саду. Оказывает отталкивающий эффект от зайцев, мышей, змеи, ящериц;
            - идеально подходит для пропитки лодок, пирсов, домов, столбов, канатов и других материалов, нуждающихся в защите от грибка, плесени.            
            `
        },
    ]
}

const services = (state = initToggleBlocks, action) => {

    switch (action.type) {


        case 'GET_SERVICES_ITEM':

            //  Очищаем item от active class
            state.servicesPage[0].servicesItems.map((item, i) => {

                item.active = false;
            });

            let servItem = {};

            console.log('GET_SERVICES_ITEM: ', action.param);

            state.servicesPage[0].servicesItems.map((item, i) => {

                if (i === action.param) {
                    item.active = true;
                    servItem = item;
                }

            });

            return {
                ...state,
                viewServices: state.servicesPage,
                servicesItemId: servItem
            }


        case 'GET_SERVICES':

            return {
                ...state,
                viewServices: state.servicesPage,
                view: 'SERVICES',
                servicesProductsId: {}
            }

        case 'GET_SERVICES_PROD':

            //  Очищаем item от active class
            state.servicesProducts.map((item, i) => {

                item.active = false;

                if (i === 0) {
                    item.active = true;
                }
            });

            return {
                ...state,
                viewServices: state.servicesProducts,
                view: 'SERVICES_PROD',
                servicesProductsId: state.servicesProducts[0]
            }

        case 'GET_SERVICES_PROD_ID':

            //  Очищаем item от active class
            state.servicesProducts.map((item, i) => {

                item.active = false;
            });


            const itemServicesId = state.servicesProducts.find((item, i) => {

                if (item.title === action.param) {
                    return item.active = true;
                }
            });

            return {
                ...state,
                servicesProductsId: itemServicesId
            }

        default:
            return {
                ...state
            }
    }
}

export default services;